# CLI Tools
brew "bat"
brew 'ctags'
brew "ripgrep"
brew "svn"
brew "python@3.9"
brew "curl"
brew "nginx"
brew "node"
brew "redis"
brew "yarn"
brew "prettier"

# General Applications
cask "github"
cask "google-chrome"
cask "iterm2"
cask "spotify"
cask "tunnelblick"

# System Helpers
cask "dozer"

# Fonts
tap "homebrew/cask-fonts"
cask 'font-source-code-pro-for-powerline'
