# CLI Tools
brew "bat"
brew 'ctags'
brew "ripgrep"
brew "svn"
brew "pyenv"
brew "curl"
brew "node"
brew "redis"
brew "yarn"
brew "prettier"
brew "git-lfs"
brew "mosh"
brew "fzf"
brew "kubectl"
brew "lastpass-cli"
brew "go"
brew "mypy"

cask "flutter"

# General Applications
tap "homebrew/cask"

cask "google-chrome"
cask "spotify"
cask "numi"
cask "lastpass"

# Coding Applications
cask "iterm2"
cask "github"
cask "viscosity"
cask "db-browser-for-sqlite"
cask "docker"

# System Helpers
cask "dozer"
cask "keepingyouawake"

# Fonts
tap "homebrew/cask-fonts"
cask 'font-hack'
